;; -*- no-byte-compile: t; -*-
;;; editor/myorg/packages.el

(package! md-roam :recipe (:host github :repo "nobiot/md-roam"))
(package! org-noter)
(package! org-roam-server)
(package! org-marginalia :recipe (:host github :repo "nobiot/org-marginalia"))
(package! org-transclusion :recipe (:host github :repo "nobiot/org-transclusion"))
(package! nroam :recipe (:host github :repo "NicolasPetton/nroam"))
(package! impatient-mode)
(package! poly-markdown)
;; (package! org-latex-impatient)

(package! org-journal)
(package! org-pdftools)
(package! org-noter-pdftools)
(package! calibredb)
(package! nov)
